{
  "@context": "https://schema.org/",
  "@type": "Recipe",
  "name": "Pistachio pavlova with rosewater berries",
  "image": "https://ui.assets-asda.com:443/dm/384f0397-2aff-11e9-8802-7daf07a34f81_R1",
  "totalTime": "PT1M",
  "description": "‘This dessert dish makes the most of beautiful Middle Eastern flavourings like rosewater and pistachio.'",
  "keywords": "dessert,egg whites,meringue,middle east,pavlova,pistachio,summer",
  "recipeCategory": "Baking,Dessert",
  "recipeIngredient": [
    "4 medium egg whites",
    "225g caster sugar",
    "1tsp cornflour",
    "1tsp white wine vinegar",
    "50g pistachios very finely chopped, plus extra, roughly chopped, to decorate",
    "200g strawberries, hulled and chopped",
    "200g raspberries",
    "2tbsp icing sugar",
    "½tsp rosewater",
    "300g whipping cream",
    "1tbsp Asda Rose Petals, to decorate"
  ],
  "recipeCuisine": "Middle Eastern",
  "recipeInstructions": [
    "Preheat the oven to 160C/140C Fan/Gas 3. Line a large baking sheet with baking paper.",
    "Beat the egg whites with an electric hand-whisk until stiff peaks form. Slowly add the sugar, 1tbsp at a time, whisking continuously, until all of it is used and the peaks are stiff and shiny. Whisk in the cornflour and vinegar, then fold in the finely chopped pistachios with a large metal spoon to create green swirls.",
    "Spoon the mixture onto the baking sheet. Spread out without flattening to create a circle about 23cm in diameter and create peaks with a fork. Bake for 1 hr then switch off the oven, open the door and allow the meringue to cool.",
    "Put the berries, icing sugar and rosewater in a bowl then toss together.",
    "Lightly whip the cream until it forms soft peaks.",
    "Build your pavlova just before serving. Spoon the whipped cream into the centre of the meringue and top with the berries and any juices. Scatter with the rose petals and roughly chopped pistachios to decorate, then serve immediately."
  ],
  "recipeYield": 12,
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingValue": 3.77,
    "reviewCount": 13
  },
  "nutrition": { "@type": "NutritionInformation", "calories": "228kcal" }
}
